Revit 2027 API
OverrideGraphicSettings.SetCutForegroundPatternColor Method
 Sets the override color of the foreground pattern of cut faces.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public OverrideGraphicSettings SetCutForegroundPatternColor(
	Color color
)
Public Function SetCutForegroundPatternColor (
	color As Color
) As OverrideGraphicSettings
public:
OverrideGraphicSettings^ SetCutForegroundPatternColor(
	Color^ color
)
member SetCutForegroundPatternColor :
        color : Color -> OverrideGraphicSettings
Parameters
color Color
 Value of the cut face foreground color for the override. InvalidColorValue means no override is set.
Return Value
OverrideGraphicSettings
 Reference to the changed object.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
OverrideGraphicSettings Class
Autodesk.Revit.DB Namespace